<route lang="yaml">
meta:
  enabled: false
</route>

<script setup lang="ts">
defineOptions({
  name: 'FeatureExampleScroll',
})

const scrollTop = ref(0)

// 激活时定位到缓存的滚动位置
onActivated(() => {
  nextTick(() => {
    document.documentElement.scrollTop = scrollTop.value
  })
})

// 离开时记录当前页面滚动位置
onBeforeRouteLeave((to, from, next) => {
  scrollTop.value = document.documentElement.scrollTop
  next()
})
</script>

<template>
  <div>
    <PageHeader title="记录滚动位置" content="当前路由需开启页面缓存。你可以滚动当前页，然后跳转到其它页面，再回来时会自动定位到离开时的滚动位置" />
    <div>
      <PageMain title="宇宙起源">
        <p>宇宙是广袤空间和其中存在的各种天体以及弥漫物质的总称。宇宙起源是一个极其复杂的问题。 宇宙是物质世界，它处于不断的运动和发展中。千百年来，科学家们一直在探寻宇宙是什么时候、如何形成的。直到今天，许多科学家认为，宇宙是由大约137亿年前发生的一次大爆炸形成的。宇宙内的所存物质和能量都聚集到了一起，并浓缩成很小的体积，温度极高，密度极大，瞬间产生巨大压力，之后发生了大爆炸，这次大爆炸的反应原理被物理学家们称为量子物理。大爆炸使物质四散出去，宇宙空间不断膨胀，温度也相应下降，后来相继出现在宇宙中的所有星系、恒星、行星乃至生命。</p>
      </PageMain>
      <PageMain title="研究经历">
        <p>空间和时间的本质是什么？这是从2000多年前的古代哲学家到现代天文学家一直都在苦苦思索的问题。经过了哥白尼、赫歇尔、哈勃的从太阳系、银河系、河外星系的探索宇宙三部曲，宇宙学已经不再是幽深玄奥的抽象哲学思辨，而是建立在天文观测和物理实验基础上的一门现代科学。</p>
        <p>直到20世纪，出现了两种“宇宙模型”比较有影响。一是稳态理论，一是大爆炸理论。20世纪20年代后期，爱德温·哈勃发现了红移现象，说明宇宙正在膨胀。20世纪60年代中期，阿尔诺·彭齐亚斯和罗伯特·威尔逊（Robert Wilson）发现了“宇宙微波背景辐射”。这两个发现给大爆炸理论以有力的支持。</p>
      </PageMain>
      <PageMain title="相关理论">
        <p>现代宇宙系当中最有影响的一种学说，又称大爆炸宇宙学。与其它宇宙模型相比，它能说明较多的观测事实。它的主要观点是认为我们的宇宙曾有一段从热到冷的演化历程。在这个时期里，宇宙体系并不是静止的，而是在不断地膨胀，使物质密度从密到稀地演化。这一从热到冷、从密到稀的过程如同一次规模巨大的爆发。根据大爆炸宇宙学的观点，大爆炸的整个过程是：在宇宙的早期，温度极高，在100亿度以上。物质密度也相当大，整个宇宙体系达到平衡。宇宙间只有中子、质子、电子、光子和中微子等一些基本粒子形态的物质。但是因为整个体系在不断膨胀，结果温度很快下降。当温度降到10亿度左右时，中子开始失去自由存在的条件，它要么发生衰变，要么与质子结合成重氢、氦等元素；化学元素就是从这一时期开始形成的。温度进一步下降到100万度后，早期形成化学元素的过程结束（见元素合成理论）。宇宙间的物质主要是质子、电子、光子和一些比较轻的原子核。当温度降到几千度时，辐射减退，宇宙间主要是气态物质，气体逐渐凝聚成气云，再进一步形成各种各样的恒星体系，成为我们今天看到的宇宙。大爆炸模型能统一地说明以下几个观测事实：</p>
        <ol>
          <li>大爆炸理论主张所有恒星都是在温度下降后产生的，因而任何天体的年龄都应比自温度下降至今天这一段时间为短，即应小于200亿年。各种天体年龄的测量证明了这一点。</li>
          <li>观测到河外天体有系统性的谱线红移，而且红移与距离大体成正比。如果用多普勒效应来解释，那么红移就是宇宙膨胀的反映。</li>
          <li>在各种不同天体上，氦丰度相当大，而且大都是30%。用恒星核反应机制不足以说明为什么有如此多的氦。而根据大爆炸理论，早期温度很高，产生氦的效率也很高，则可以说明这一事实。</li>
          <li>根据宇宙膨胀速度以及氦丰度等，可以具体计算宇宙每一历史时期的温度。大爆炸理论的创始人之一伽莫夫曾预言，今天的宇宙已经很冷，只有绝对温度几度。1965年，果然在微波波段上探测到具有热辐射谱的微波背景辐射，温度约为3K。</li>
        </ol>
        <p>大爆炸理论认为，宇宙起源于一个单独的无维度的点，即一个在空间和时间上都无尺度但却包含了宇宙全部物质的奇点。至少是在120～150亿年以前，宇宙及空间本身由这个点爆炸形成。</p>
        <p>在一次无与伦比的大爆炸中分裂成无数碎片，形成了今天的宇宙。1948年，俄裔美籍物理学家伽莫夫等人，又详细勾画出宇宙由一个致密炽热的奇点于150亿年前一次大爆炸后，经一系列元素演化到最后形成星球、星系的整个膨胀演化过程的图像，该理论存在许多使人迷惑之处。</p>
        <p>宏观宇宙是相对无限延伸的。“大爆炸宇宙论”关于宇宙当初仅仅是一个点，而它周围却是一片空白，即将人类至今还不能确定范围也无法计算质量的宇宙压缩在一个极小空间内的假设只是一种臆测。况且从能量与质量的正比关系考虑，一个小点无缘无故地突然爆炸成浩瀚宇宙的能量从何而来呢？</p>
        <p>人类把地球绕太阳转一圈确定为衡量时间的标准——年。宇宙中所有天体的运动速度都是不同的，在宇宙范围，时间没有衡量标准。譬如地球上东西南北的方向概念在宇宙范围就没有任何意义。既然年的概念对宇宙而言并不存在，大爆炸宇宙论又如何用年的概念去推算宇宙的确切年龄呢？</p>
        <p>1929年，美国天文学家哈勃提出了星系的红移量与星系间的距离成正比的哈勃定律，并推导出星系都在互相远离的宇宙膨胀说。哈勃定律只是说明了距离地球越远的星系运动速度越快--星系红移量与星系距离呈正比关系。但他没能发现很重要的另一点--星系红移量与星系质量也呈正比关系。</p>
        <p>宇宙中星系间距离非常非常遥远，光线传播因空间物质的吸收、阻挡会逐渐减弱，那些运动速度越快的星系就是质量越大的星系。质量大，能量辐射就强，因此我们观察到的红移量极大的星系，当然是质量极大的星系。这就是被称作“类星体”的遥远星系因质量巨大而红移量巨大的原因。另外那些质量小、能量辐射弱的星系（除极少数距银河系很近的星系，如大、小麦哲伦星系外）则很难观察到，大小恒星都能看到，所以恒星的红移紫移数量大致相等。</p>
      </PageMain>
    </div>
  </div>
</template>
